/* copyright (c)  zhouqian 2012-07-15 All rights reserved   */
/****************************************************************
	模型		: 
	机能		: 
	作者		: 
	备注		:
			 
*****************************************************************/
#ifndef _TIMER_H_
#define _TIMER_H_

/*===============================================================
头文件声明
================================================================*/
#include "../../Platform/CPU/Comm.h"


/*==============================================================
define声明
===============================================================*/
#define     Time_Clear			0x00	/*定时清除*/
#define		Time_1SEC_char8		0x10	/*定时1s，数字随CPU的时钟频率变更*/
#define		Time_2SEC_char8		0x100	/*定时1s，数字随CPU的时钟频率变更*/
#define     Time_500ms_char8	0x0f	/*定时500ms，数字随CPU的时钟频率变更*/
#define     Time_128ms_char8	0x03	/*定时128ms，数字随CPU的时钟频率变更*/



/*===============================================================
Static RAM声明
===============================================================*/


/*===============================================================
函数声明
===============================================================*/


/**************************************
Funcname	:
Contents 	:
Input		:
Return		:
Remart		:	 

***************************************/

public _UBYTE tcount( _UBYTE *counter );
public _UBYTE tcount_int( _UINT *counter );
public void timer_8ms_task( void );	/*计数任务*/
public void timer_reset_init( void );/*timer 初始化函数*/

#endif
/*===================================================================
Version	|	Date		|	Author	|	Contents  					|
---------------------------------------------------------------------
V1.00		2012-08-19		ZQ			New code write.

====================================================================*/

