/* copyright (c)  zhouqian 2012-10-19 All rights reserved   */
/****************************************************************
	模型		: 全模型
	机能		: 端口配置文件
	作者		: ZQ
	备注		: 端子定义文件
			 
*****************************************************************/


/**************************************
IDA0CN :IDA0控制器寄存器
00000000[]
||||||||
|||||||+________ [IDA0EN]:IDA0使能位
|||||||       		    0:IDA0禁止
||||||| 				1:IDA0使能
||||+++_________ [IDA0CM]:输出更新源选择位
||||    				000:定时器0溢出触发DAC输出更新
||||    				001:定时器1溢出触发DAC输出更新       
||||    				010:定时器2溢出触发DAC输出更新       
||||    				011:定时器3溢出触发DAC输出更新       
||||    				100:CNVSTR上升沿触发DAC输出更新  
||||    				101:CNVSTR下升沿触发DAC输出更新  
||||    				110:CNVSTR两个边沿触发DAC输出更新  
||||    				111:写IDAOH触发DAC输出更新  
||++_____________ [NC]:未使用,读 =00b,写忽略
++_______________ [IDA0OMD]:IDA0输出方式选择位
					      00:0.5mA满度输出电流
					      01:1.0mA满度输出电流
					      1x:2.0mA满度输出电流

00000000
||||||||
||||||++___________ [IDA0OMD]:IDA0输出方式选择位
||||||				      00:0.5mA满度输出电流
||||||				      01:1.0mA满度输出电流
||||||				      1x:2.0mA满度输出电流
||||++_____________ [NC]:未使用,读 =00b,写忽略
|+++_______________ [IDA0CM]:输出更新源选择位
|    					000:定时器0溢出触发DAC输出更新
|    					001:定时器1溢出触发DAC输出更新       
|		   				010:定时器2溢出触发DAC输出更新       
|	    				011:定时器3溢出触发DAC输出更新       
|	    				100:CNVSTR上升沿触发DAC输出更新  
|	    				101:CNVSTR下升沿触发DAC输出更新  
|	    				110:CNVSTR两个边沿触发DAC输出更新  
|	    				111:写IDAOH触发DAC输出更新  
+__________________ [IDA0EN]:IDA0使能位
 						0:IDA0禁止
						1:IDA0使能	
*************************************/
#define Port_IDA0		0b1111
	





/*===================================================================
Version	|	Date		|	Author	|	Contents  					|
---------------------------------------------------------------------
V1.00		2012-08-19		ZQ			New code write.

====================================================================*/
