/* copyright (c)   2013-03-18 All rights reserved  */
/**************************************************************************
	模型	: 
	
	机能	: 
	
	作者	: 
	
	备注	: RingBuffer各模块使用时，不超过255Byte,由RB_DTSIZE决定
***************************************************************************/
/*==========================================================================
头文件声明
===========================================================================*/
#ifndef _MODULE_RINGBUFFER_ARI_
#define _MODULE_RINGBUFFER_ARI_

/*=========================================================================
Define定义
==========================================================================*/
/**********************
RingBuffer数据类型定义
**********************/
typedef unsigned char RB_DTSIZE;
#define public extern
#define private static
/**********************
RingBuffer管理最大可能数
**********************/
#define	RB_NUM_MAXENTRY		1
#define	RB_VAL_ENTRY_NG		0x00

/*=========================================================================
Typedef定义
==========================================================================*/	
/**********************
RingBuffer状态
**********************/
typedef	enum{
	RB_STS_NORMAL = 0,
	RB_STS_EMPTY,
	RB_STS_FULL
}	ERBStatus;

/*=========================================================================
外部函数声明
==========================================================================*/	
public unsigned char RB_reqEntry (unsigned char *, RB_DTSIZE);
public void	RB_initRingBuffer(unsigned char);
public ERBStatus RB_getBufferStatus	(unsigned char);
public void	RB_putRingBuffer (unsigned char, unsigned char);
public unsigned char RB_getRingBuffer (unsigned char);

#endif/*_MODULE_RINGBUFFER_ARI_*/
/***************************************************************************
----------------------------------------------------------------------------
VersionUP情报
----------------------------------------------------------------------------
 Version	|	Date	|	Author	
 Contents .
----------------------------------------------------------------------------
 Ver1.00		2013-02-28		ZQ.		
 New code write.

==========================================================================*/