/* copyright (c)  周前 2013-03-18 All rights reserved  */
/**************************************************************************
	模型	: ZQ01
	
	机能	: 功能研究
	
	作者	: 周前
	
	备注	: 
***************************************************************************/
/*==========================================================================
头文件声明
===========================================================================*/
/**********************
System Information
**********************/
#include <string.h>				/* memcpy(),memset()etc */

/**********************
Environment Information
**********************/
//#include "../Platform/Platform.h"		/* Platform Information	*/

/**********************
User Information
**********************/
#include "./RingBuffer.h"



/*=========================================================================
Define定义
==========================================================================*/


/*=========================================================================
表格定义
==========================================================================*/


/*=========================================================================
内部变量声明
==========================================================================*/
/**********************
RingBuffer管理
**********************/
typedef	struct{
	ERBStatus	status;			/* Buffer状态	*/
	unsigned char *	pAddr;		/* Buffer开始Address	*/
	RB_DTSIZE	size;		/* Buffer数据大小[byte]	*/
	RB_DTSIZE	posR;		/* Read读位置		*/
	RB_DTSIZE	posW;		/* Write写位置		*/
}	SRingBufferInfo;

private SRingBufferInfo	s_aRingBufferInfo[RB_NUM_MAXENTRY];
private unsigned char	s_entryRest = RB_NUM_MAXENTRY;


/*=========================================================================
外部变量声明
==========================================================================*/



/*=========================================================================
函数声明
==========================================================================*/



/*=========================================================================
Funcname	: RB_getEntryNo
Contents 	: Ringbuffer登录号取得
Input		: void
Return		: 返回Ringbuffer登录号
Remart		:	 
==========================================================================*/
private unsigned char RB_getEntryNo(void)
{
	/*************************************************************
		临时变量定义
	*************************************************************/
	unsigned char	entryNo = RB_VAL_ENTRY_NG;
	
	/*************************************************************
		登录号是否已满
	*************************************************************/
	if(s_entryRest > 0x00)
	{
		entryNo = s_entryRest;		/* 登录号取得*/
		s_entryRest--;				/* 剩余数-1		*/
	}
	
	/*************************************************************
		取得结果返回
	*************************************************************/
	return	entryNo;
}



/*=========================================================================
Funcname	: RB_initRingBuffer
Contents 	: Ringbuffer情报初始化
Input		: Ringbuffer的地址，以及其大小
Return		: 登录号
Remart		:	 
==========================================================================*/
public void RB_initRingBuffer(unsigned char entryNo)
{
	/*************************************************************
		临时变量定义
	*************************************************************/
	unsigned char	index;			/* RingBuffer索引号*/
	
	/*************************************************************
		指定登录号的初始化
	*************************************************************/
	if((entryNo != RB_VAL_ENTRY_NG)&&(entryNo <= RB_NUM_MAXENTRY))
	{
		/*===================================================
		索引号生成
		===================================================*/	
		index = (entryNo-1);		/* 登录号-1为实际RingBuffer的位置*/

		/*===================================================
		对象RingBuffer的初始化
		===================================================*/	
		s_aRingBufferInfo[index].status	= RB_STS_EMPTY;
		s_aRingBufferInfo[index].posR	= 0x00000000;
		s_aRingBufferInfo[index].posW	= 0x00000000;
		memset(s_aRingBufferInfo[index].pAddr, 0x00, s_aRingBufferInfo[index].size);
	}
}


/*=========================================================================
Funcname	: RB_reqEntry
Contents 	: 登录号注册
Input		: Ringbuffer的地址，以及其大小
Return		: 登录号
Remart		:	 
==========================================================================*/
public unsigned char RB_reqEntry(unsigned char * pEntryAddr, RB_DTSIZE entrySize)
{
	/*************************************************************
		临时变量定义
	*************************************************************/
	unsigned char	entryNo;		/* 登录编号	*/
	unsigned char	index;			/* RingBuffer索引号	*/
	/*************************************************************
		RingBuffer登录处理
	*************************************************************/
		/*===================================================
		登录编号取得
		===================================================*/
	entryNo = RB_getEntryNo();
	
		/*===================================================
		登录编号成功取得的场合
		===================================================*/
	if (entryNo != RB_VAL_ENTRY_NG){

		/*===================================================
		索引号生成
		===================================================*/			
		index = (entryNo-1);		/* 登录号-1为实际RingBuffer的位置*/
	
		/*===================================================
		指定Buffer情报设定
		===================================================*/	
		s_aRingBufferInfo[index].pAddr = pEntryAddr;
		s_aRingBufferInfo[index].size  = entrySize;
		
		/*===================================================
		登录时情报的初始化
		===================================================*/
		RB_initRingBuffer(entryNo);	/* 指定的登录号	*/
	}
	/*************************************************************
		取得登录号通知
	*************************************************************/
	return	entryNo;
}


/*=========================================================================
Funcname	: RB_getBufferStatus
Contents 	: Ringbuffer状态获取
Input		: Ringbuffer登录号
Return		: 指定登录号的状态
Remart		:	 
==========================================================================*/
public ERBStatus RB_getBufferStatus(unsigned char entryNo)
{
	/*************************************************************
		临时变量定义
	*************************************************************/
	ERBStatus	eStatus;			/* RingBuffer状态	*/
	unsigned char	index;			/* RingBuffer索引号*/
	
	/*************************************************************
		INDEX获取
	*************************************************************/
	index = (entryNo-1);			/* 登录号-1为实际RingBuffer的位置*/
	
	/*************************************************************
		指定RingBuffer的状态取得
	*************************************************************/
	eStatus = s_aRingBufferInfo[index].status;
	if(eStatus != RB_STS_FULL)
	{
		eStatus = ( s_aRingBufferInfo[index].posW == s_aRingBufferInfo[index].posR?RB_STS_EMPTY:RB_STS_NORMAL );
	}
	
	/*************************************************************
		指定RingBuffer的状态返回
	*************************************************************/
	return	(eStatus);
}


/*=========================================================================
Funcname	: RB_putRingBuffer
Contents 	: Ringbuffer数据存储
Input		: Ringbuffer登录号，需要存储的数据
Return		: void
Remart		:	 
==========================================================================*/
public void RB_putRingBuffer(unsigned char entryNo ,unsigned char data_temp)
{
	/*************************************************************
		临时变量定义
	*************************************************************/
	unsigned char	index;			/* RingBuffer索引号*/
	
	/*************************************************************
		INDEX获取
	*************************************************************/
	index = ( entryNo-1 );			/* 登录号-1为实际RingBuffer的位置*/

	/*************************************************************
		RingBuffer状态确认(Full时，不能执行存储)
	*************************************************************/
	if( s_aRingBufferInfo[index].status != RB_STS_FULL )
	{
		/*===================================================
		RingBuffer数据存储
		===================================================*/
		s_aRingBufferInfo[index].pAddr[s_aRingBufferInfo[index].posW] = data_temp;
		
		/*===================================================
		RingBuffer写数据的地址变更
		===================================================*/
		s_aRingBufferInfo[index].posW++;
		if(s_aRingBufferInfo[index].posW == s_aRingBufferInfo[index].size)
		{
			s_aRingBufferInfo[index].posW = 0x00000000;
		}
		
		/*===================================================
		RingBuffer状态更新
		===================================================*/
		s_aRingBufferInfo[index].status = (s_aRingBufferInfo[index].posW==s_aRingBufferInfo[index].posR?RB_STS_FULL:RB_STS_NORMAL);
	}
}


/*=========================================================================
Funcname	: RB_getRingBuffer
Contents 	: Ringbuffer数据读取
Input		: Ringbuffer登录号
Return		: 数据返回
Remart		:	 
==========================================================================*/
public unsigned char RB_getRingBuffer(unsigned char entryNo)
{
	/*************************************************************
		临时变量定义
	*************************************************************/
	unsigned char	data_temp = 0x00;		
	unsigned char	index;				/* RingBuffer索引号*/
	
	/*************************************************************
		IDEX取得
	*************************************************************/
	index = (entryNo-1);			/* 登录号-1为实际RingBuffer的位置*/
	
	/*************************************************************
		RingBuffer数据读取
	*************************************************************/
		/*===================================================
		RingBuffer状态确认(Empty时，不能执行读取)
		===================================================*/
	if(s_aRingBufferInfo[index].status != RB_STS_EMPTY)
	{

		/*===================================================
		获取数据
		===================================================*/
		data_temp = s_aRingBufferInfo[index].pAddr[s_aRingBufferInfo[index].posR];
		
		/*===================================================
		RingBuffer读数据的地址变更
		===================================================*/
		s_aRingBufferInfo[index].posR++;
		if(s_aRingBufferInfo[index].posR == s_aRingBufferInfo[index].size)
		{
			s_aRingBufferInfo[index].posR = 0x00000000;/*所有数据读取过，R位置清掉*/
		}
		
		/*===================================================
		RingBuffer状态更新
		===================================================*/
		if(s_aRingBufferInfo[index].status == RB_STS_FULL)/* 写满的状态，变为正常状态	*/
		{	
			s_aRingBufferInfo[index].status = RB_STS_NORMAL;
		}
	}
	/*************************************************************
		返回获取的数据
	*************************************************************/
	return	data_temp;
}


/***************************************************************************
----------------------------------------------------------------------------
VersionUP情报
----------------------------------------------------------------------------
 Version	|	Date	|	Author	
 Contents .
----------------------------------------------------------------------------
 Ver1.00		2013-03-18		ZQ.		
 New code write.

==========================================================================*/
